---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ManyDirectionCurvesError
source: html/0bc0e6f2-087f-fd56-32f7-9e80a080618e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ManyDirectionCurvesError Property

More than one direction curve specified.

## Syntax (C#)
```csharp
public static FailureDefinitionId ManyDirectionCurvesError { get; }
```